CSI API ETABS v1
cAnalysisResultsSetup.GetComboSelectedForOutput Method
 Checks if a load combination is selected for output
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetComboSelectedForOutput(
	string Name,
	ref bool Selected
)
Function GetComboSelectedForOutput (
	Name As String,
	ByRef Selected As Boolean
) As Integer
Dim instance As cAnalysisResultsSetup
Dim Name As String
Dim Selected As Boolean
Dim returnValue As Integer
returnValue = instance.GetComboSelectedForOutput(Name,
	Selected)
int GetComboSelectedForOutput(
	String^ Name,
	bool% Selected
)
abstract GetComboSelectedForOutput :
        Name : string *
        Selected : bool byref -> int
Parameters
Name
Type: System.String
 The name of an existing load combination
Selected
Type: System.Boolean
 This item is True if the specified load combination is selected for output
Return Value
Type: Int32
 Returns 0 if the selected flag is successfully retrieved, otherwise it returns nonzero
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Selected As Boolean
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add combo
       ret = SapModel.RespCombo.Add("COMB1", 0)
   'add load case to combo
       ret = SapModel.RespCombo.SetCaseList("COMB1", eCNameType.LoadCase, "DEAD", 1.4)
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis
   'deselect all cases and combos
       ret = SapModel.Results.Setup.DeselectAllCasesAndCombosForOutput
   'set combo selected for output
       ret = SapModel.Results.Setup.SetComboSelectedForOutput("COMB1")
   'check if combo is selected
       ret = SapModel.Results.Setup.GetComboSelectedForOutput("COMB1", Selected)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalysisResultsSetup Interface
ETABSv1 Namespace